Starting Network Test Collection...
Timestamp: Wed 08 May 2024 04:52:43 PM -01
iperf3 Server IP: 192.168.200.1
iperf3 Test Duration: 30 seconds
Ping Packet Count: 
Running iperf3 test for 30 seconds...

*** iperf3 Test ***
Connecting to host 192.168.200.1, port 5201
[  5] local 192.168.200.23 port 57014 connected to 192.168.200.1 port 5201
[ ID] Interval           Transfer     Bitrate         Total Datagrams
[  5]   0.00-1.00   sec   127 KBytes  1.04 Mbits/sec  90  
[  5]   1.00-2.00   sec  42.4 KBytes   348 Kbits/sec  30  
[  5]   2.00-3.00   sec  28.3 KBytes   232 Kbits/sec  20  
[  5]   3.00-4.00   sec  42.4 KBytes   348 Kbits/sec  30  
[  5]   4.00-5.00   sec  14.1 KBytes   116 Kbits/sec  10  
[  5]   5.00-6.00   sec  42.4 KBytes   348 Kbits/sec  30  
[  5]   6.00-7.00   sec  28.3 KBytes   232 Kbits/sec  20  
[  5]   7.00-8.00   sec  28.3 KBytes   232 Kbits/sec  20  
[  5]   8.00-9.00   sec  14.1 KBytes   116 Kbits/sec  10  
[  5]   9.00-10.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  10.00-11.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  11.00-12.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  12.00-13.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  13.00-14.00  sec  0.00 Bytes  0.00 bits/sec  0  
[  5]  14.00-15.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  15.00-16.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  16.00-17.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  17.00-18.00  sec  0.00 Bytes  0.00 bits/sec  0  
[  5]  18.00-19.00  sec  0.00 Bytes  0.00 bits/sec  0  
[  5]  19.00-20.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  20.00-21.00  sec  28.3 KBytes   232 Kbits/sec  20  
[  5]  21.00-22.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  22.00-23.00  sec  42.4 KBytes   348 Kbits/sec  30  
[  5]  23.00-24.00  sec  42.4 KBytes   347 Kbits/sec  30  
[  5]  24.00-25.00  sec  28.3 KBytes   232 Kbits/sec  20  
[  5]  25.00-26.00  sec  28.3 KBytes   232 Kbits/sec  20  
[  5]  26.00-27.00  sec  28.3 KBytes   232 Kbits/sec  20  
[  5]  27.00-28.00  sec  28.3 KBytes   232 Kbits/sec  20  
[  5]  28.00-29.00  sec  14.1 KBytes   116 Kbits/sec  10  
[  5]  29.00-30.00  sec  56.6 KBytes   464 Kbits/sec  40  
- - - - - - - - - - - - - - - - - - - - - - - - -
[ ID] Interval           Transfer     Bitrate         Jitter    Lost/Total Datagrams
[  5]   0.00-30.00  sec   792 KBytes   216 Kbits/sec  0.000 ms  0/560 (0%)  sender
[  5]   0.00-31.70  sec   749 KBytes   194 Kbits/sec  45.492 ms  30/560 (5.4%)  receiver

iperf Done.
\n Running CLI test...
---------------------------------------------------
[MAC Configuration]
Device Mode			 : STA
MAC Address			 : 00:c0:ca:b4:65:2e
Country				 : DE
Bandwidth			 : 2M
Frequency			 : 8640
MAC80211_freq			 : 5205
Rate Control			 : ON
 -MCS				 : 0
 -bw				 : 2 Mhz (NRC Auto)
Guard Interval			 : LONG
Security			 : OFF
RTS				 : OFF
RTS threshold			 : 0
Format				 : S1G
Preamble type			 : S1G_SHORT
Promiscuous Mode		 : OFF
color				 : 0x0
Auto CFO Cal			 : OFF
BSSID				 : 00:c0:ca:b4:65:38
AID				 : 1

[PHY Configuration]
TX_Gain				 : 14
RX_Gain				 : 82

Tx Power			 : 14
---------------------------------------------------
OK
spawn ./cli_app
===================================================
     Newracom Command Line Application (2.10)      
===================================================
NRC> show signal start 1 12
OK
NRC> Mac Addr : 00:c0:ca:b4:65:38	rssi: -96  	snr: 7

Mac Addr : 00:c0:ca:b4:65:38	rssi: -97  	snr: 7

Mac Addr : 00:c0:ca:b4:65:38	rssi: -97  	snr: 8

Mac Addr : 00:c0:ca:b4:65:38	rssi: -98  	snr: 7

Mac Addr : 00:c0:ca:b4:65:38	rssi: -98  	snr: 7

Mac Addr : 00:c0:ca:b4:65:38	rssi: -98  	snr: 7

Mac Addr : 00:c0:ca:b4:65:38	rssi: -100  	snr: 5

Mac Addr : 00:c0:ca:b4:65:38	rssi: -100  	snr: 5

Mac Addr : 00:c0:ca:b4:65:38	rssi: -100  	snr: 5

Mac Addr : 00:c0:ca:b4:65:38	rssi: -101  	snr: 4

Mac Addr : 00:c0:ca:b4:65:38	rssi: -101  	snr: 3

Mac Addr : 00:c0:ca:b4:65:38	rssi: -100  	snr: 4

--------------------------------------------------
[MAC Addr]: 00:c0:ca:b4:65:38
[Total]   : 12
[RSSI]
 average  : -98.833
 std_dev  : 1.624
[SNR]
 average  : 5.750
 std_dev  : 1.534
--------------------------------------------------
NRC>
exit
===================================================
      Exit Newracom Command Line Application       
===================================================

Network test collection completed.
